In [10]:
import numpy as np
import pandas as pd

In [11]:
df = pd.DataFrame([[1, 4, 6], [-2, 7, -13], [0, -1, 5]])
df

   0  1   2
0  1  4   6
1 -2  7 -13
2  0 -1   5

In [12]:
np.abs(df)

   0  1   2
0  1  4   6
1  2  7  13
2  0  1   5

In [13]:
np.negative(df)

   0  1   2
0 -1 -4  -6
1  2 -7  13
2  0  1  -5

In [17]:
df.drop([0], axis=1)

   1   2
0  4   6
1  7 -13
2 -1   5

In [20]:
df[3] = np.zeros(3).astype(int)
df

   0  1   2  3
0  1  4   6  0
1 -2  7 -13  0
2  0 -1   5  0

In [15]:
df.iloc[1, :].max()

7

In [21]:
df.iloc[1, :].min()

-13

In [22]:
sum(df)

6

In [26]:
sum(df.iloc[:, 1])

10